site.org
#+title: Random bits and pieces
#+subtitle: ...about programming, languages, tools, FLOSS software...
#+author: Igor Dejanović
#+hugo_base_dir: .
#+hugo_section: /
#+options: creator:t author:nil

*** Испитна питања
:PROPERTIES:
:EXPORT_FILE_NAME: ispitna_pitanja
:END:
#+begin_quote
У изради.
#+end_quote

1. Дефиниши софтверски језик.
2. Дефиниши домен.
3. Шта је језик специфичан за домен?
4. Када језик можемо сматрати ЈСД?
5. У чему је разлика између језика специфичног за домен и језика опште намене?
6. Шта је главни разлог подизања продуктивности употребом ЈСД?
7. Опиши проблем менталног мапирања код развоја софтвера.
8. Како ЈСД утиче на квалитет софтвера?
9. Како ЈСД утиче на еволуцију и одржавање апликација?
10. Опиши главне архитектуре приликом израде ЈСД. Предности и мане.
11. Градивни елементи језика.
12. Шта је апстрактна синтакса језика? Наведи пример.
13. Шта је конкретна синтакса језика? Наведи пример.
14. Како можемо дефинисати семантику језика?
15. Класификација језика према врсти конкретне синтаксе.
16. Текстуалне синтаксе - предности и мане.
17. Графичке синтаксе - предности и мане.
18. Подела ЈСД према врсти домена. Наведи пример.
19. Подела ЈСД према начину имплементације (интерни/екстерни). Предности и мане. Наведи пример.
20. Мане/критике ЈСД.
21. Шта су језичке радионице?
22. Приступи у изради језичких радионица.
23. Шта су пројекциони едитори? У чему се разликују од радионица базираних на парсирању.
24. Шта је парсирање или синтаксна анализа?
25. Шта је стабло парсирања или стабло конкретне синтаксе?
26. Шта је стабло апстрактне синтаксе? По чему се разликује од стабла парсирања?
    Објасни на примеру.
27. Шта је секундарна нотација/синтакса?
28. Како дефинишемо модел?
29. Које су основне карактеристике модела?
30. Шта је мета-модел?
31. Шта је мета-метамодел? Које мета-метамоделе познајеш?
32. Шта је мета-језик?
33. Објасни стек за мета-моделовање. Паралела са класичним програмским језицима.
34. Шта представљају "мета" везе (/conformsTo/) између мета-нивоа? Каква је
    разлика између веза истанцирања унутар једног мета-нивоа и између
    мета-нивоа?
35. Које операције користимо при мета-моделовању?
36. Шта је апстракција? Између којих мета-нивоа стека за мета-моделовање се користи?
37. Шта је класификација? Каква је веза са мета-нивоима стека за
    мета-моделовање? Где се може користити?
38. Шта је генерализација?
39. Шта су токен модели а шта модели типова?
40. Шта је MOF?
41. Шта је ECore?
42. Објасни усклађеност елемената кроз мета-нивое на примеру.
43. Објасни како се спроводи анализа домена.
44. Шта је свеприсутни језик?

